ZeroZap/xhsc/HC32L021/driver/src/hc32l021_sysctrl.c
/**
 *******************************************************************************
 * @file  sysctrl.c
 * @brief This file provides firmware functions to manage the SYSCTRL
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-09-18       MADS            First version
   2025-09-09       MADS            Change RCL trim address to 32-bit
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2024, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32l021_sysctrl.h"

/**
 * @addtogroup HC32L021_DDL 驱动库
 * @{
 */

/**
 * @defgroup DDL_SYSCTRL SYSCTRL模块驱动库
 * @brief Sysctrl Driver Library SYSCTRL模块驱动库
 * @{
 */
/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/
/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup SYSCTRL_Local_Macros SYSCTRL局部宏定义
 * @{
 */

/**
 * @brief  RCL Trim值
 */
#define RCL_CR_TRIM_38400_VAL (*((volatile uint32_t *)(0x001007ACul)))
#define RCL_CR_TRIM_32768_VAL (*((volatile uint32_t *)(0x001007A8ul)))

/**
 * @brief  RC48M Trim值
 */
#define RC48M_CR_TRIM_48M_VAL (*((volatile uint32_t *)(0x001007B0ul)))
#define RC48M_CR_TRIM_32M_VAL (*((volatile uint32_t *)(0x001007B4ul)))
#define RC48M_CR_TRIM_6M_VAL  (*((volatile uint32_t *)(0x001007B8ul)))
#define RC48M_CR_TRIM_4M_VAL  (*((volatile uint32_t *)(0x001007BCul)))

/**
 * @brief  Clock时钟源切换选择
 */
#define SYSCTRL_CLK_SWITCH_RC48M (0x0u << SYSCTRL_SYSCTRL0_CLKSW_Pos) /*!< 内部RC48M时钟 */
#define SYSCTRL_CLK_SWITCH_EXTH  (0x1u << SYSCTRL_SYSCTRL0_CLKSW_Pos) /*!< 从PA11输入的EXTH时钟 */
#define SYSCTRL_CLK_SWITCH_RCL   (0x2u << SYSCTRL_SYSCTRL0_CLKSW_Pos) /*!< 内部低速时钟RCL */
#define SYSCTRL_CLK_SWITCH_XTL   (0x3u << SYSCTRL_SYSCTRL0_CLKSW_Pos) /*!< 外部低速晶振XTL或从PA07输入的EXTL时钟 */
/**
 * @}
 */
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup SYSCTRL_Global_Functions SYSCTRL全局函数定义
 * @{
 */

/**
 * @brief  时钟初始化函数 (用于上电后，系统工作之前对主频及外设时钟进行初始化)
 * @param  [in] pstcClocklInit 初始化配置结构体指针 @ref stc_sysctrl_clock_init_t
 * @retval en_result_t
 *           - Ok: 成功
 *           - ErrorInvalidParameter：无效参数
 * @note   若使用外部晶振，用户需根据实际情况提前设置好其相关参数，如振幅、驱动能力等
 * @note   本驱动默认宏定义：SYSTEM_EXTH=8MHz,SYSTEM_EXTL=32768Hz,如使用其它频率外部时钟或晶振，必须修改这两个宏定义的值
 * @note   如手动修改或者调用CTRIM修改RC48M/RCL时钟的TRIM值，需根据实际频率值设置正确的FLASH wait cycle
 */
en_result_t SYSCTRL_ClockInit(stc_sysctrl_clock_init_t *pstcClocklInit)
{
    if (pstcClocklInit->u32SysClockSrc > SYSCTRL_CLK_SRC_EXTL)
    {
        return ErrorInvalidParameter;
    }

    /* 时钟源使能 */
    SYSCTRL_ClockSrcEnable(pstcClocklInit->u32SysClockSrc);

    /* 设置FLASH wait cycle = 1 */
    WRITE_REG16(FLASH->BYPASS, 0x5A5Au);
    WRITE_REG16(FLASH->BYPASS, 0xA5A5u);
    MODIFY_REG32(FLASH->CR, FLASH_CR_WAIT_Msk, 0x1u << FLASH_CR_WAIT_Pos);

    /* 时钟源切换 */
    SYSCTRL_SysClockSwitch(pstcClocklInit->u32SysClockSrc);

    /* HCLK分频设置 */
    SYSCTRL_HclkDivSet(pstcClocklInit->u32HclkDiv);

    /* 更新Core时钟（HCLK）*/
    SystemCoreClockUpdate();
    /* 设置FLASH wait cycle */
    if (SystemCoreClock <= 24000000u)
    {
        if (READ_REG32_BIT(FLASH->CR, FLASH_CR_WAIT_Msk) != (0x0u << FLASH_CR_WAIT_Pos))
        {
            WRITE_REG16(FLASH->BYPASS, 0x5A5Au);
            WRITE_REG16(FLASH->BYPASS, 0xA5A5u);
            MODIFY_REG32(FLASH->CR, FLASH_CR_WAIT_Msk, 0x0u << FLASH_CR_WAIT_Pos); /* <= 24MHz, 设置FLASH wait cycle = 0 */
        }
    }

    return Ok;
}

/**
 * @brief  时钟源使能
 * @param  [in] u32ClockSrc 目标时钟源 @ref SYSCTRL_Clock_Src_Select
 * @retval en_result_t
 *           - Ok: 成功
 *           - ErrorInvalidParameter：无效参数
 * @note   调用此函数使能时钟之前，必须先设置目标时钟的相关参数，如驱动能力、稳定时间等
 */
en_result_t SYSCTRL_ClockSrcEnable(uint32_t u32ClockSrc)
{
    en_result_t enRet = Ok;

    if (u32ClockSrc > SYSCTRL_CLK_SRC_EXTL)
    {
        return ErrorInvalidParameter;
    }

    switch (u32ClockSrc)
    {
        case SYSCTRL_CLK_SRC_RC48M_4M:
        case SYSCTRL_CLK_SRC_RC48M_6M:
        case SYSCTRL_CLK_SRC_RC48M_32M:
        case SYSCTRL_CLK_SRC_RC48M_48M:
            if (READ_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_RC48M_EN_Msk) == 0u) /* RC48M关闭*/
            {
                SYSCTRL_SysctrlUnlock();
                SET_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_RC48M_EN_Msk);                                      /* 使能RC48M */
                while (READ_REG32_BIT(SYSCTRL->RC48M_CR, SYSCTRL_RC48M_CR_STABLE_Msk) != SYSCTRL_RC48M_CR_STABLE_Msk) /* 等待RC48M时钟稳定 */
                {
                    ;
                }
            }
            break;
        case SYSCTRL_CLK_SRC_EXTH:
            if (READ_REG32_BIT(SYSCTRL->SYSCTRL1, SYSCTRL_SYSCTRL1_EXTH_EN_Msk) == 0u) /* EXTH时钟输入关闭*/
            {
                SET_REG32_BIT(SYSCTRL->PERI_CLKEN0, SYSCTRL_PERI_CLKEN0_GPIO_EN_Msk); /* 使能GPIO外设时钟 */
                CLR_REG32_BIT(GPIOA->ADS, GPIO_ADS_PIN11_Msk);                        /* 配置为数字端口 */
                CLR_REG32_BIT(GPIOA->PIN11_SEL, GPIO_PIN11_SEL_SEL_Msk);              /* 设置为GPIO */
                SET_REG32_BIT(GPIOA->DIR, GPIO_DIR_PIN11_Msk);                        /* 配置为输入 */
                SYSCTRL_SysctrlUnlock();
                SET_REG32_BIT(SYSCTRL->SYSCTRL1, SYSCTRL_SYSCTRL1_EXTH_EN_Msk); /* 使能EXTH时钟输入 */
            }
            break;
        case SYSCTRL_CLK_SRC_RCL_32768:
        case SYSCTRL_CLK_SRC_RCL_38400:
            if (READ_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_RCL_EN_Msk) == 0u) /* RCL关闭*/
            {
                SYSCTRL_SysctrlUnlock();
                SET_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_RCL_EN_Msk);                                  /* 使能RCL */
                while (READ_REG32_BIT(SYSCTRL->RCL_CR, SYSCTRL_RCL_CR_STABLE_Msk) != SYSCTRL_RCL_CR_STABLE_Msk) /* 等待RCL时钟稳定 */
                {
                    ;
                }
            }
            break;
        case SYSCTRL_CLK_SRC_XTL:
            if (READ_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_XTL_EN_Msk) == 0u) /* XTL关闭*/
            {
                SYSCTRL_SysctrlUnlock();
                SET_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_XTL_EN_Msk); /* 使能XTL */
                SYSCTRL_SysctrlUnlock();
                CLR_REG32_BIT(SYSCTRL->SYSCTRL1, SYSCTRL_SYSCTRL1_EXTL_EN_Msk);                                 /* 禁止EXTL */
                while (READ_REG32_BIT(SYSCTRL->XTL_CR, SYSCTRL_XTL_CR_STABLE_Msk) != SYSCTRL_XTL_CR_STABLE_Msk) /* 等待XTL时钟稳定 */
                {
                    ;
                }
            }
            break;
        case SYSCTRL_CLK_SRC_EXTL:
            if (READ_REG32_BIT(SYSCTRL->SYSCTRL1, SYSCTRL_SYSCTRL1_EXTL_EN_Msk) == 0u) /* EXTL时钟输入关闭*/
            {
                SET_REG32_BIT(SYSCTRL->PERI_CLKEN0, SYSCTRL_PERI_CLKEN0_GPIO_EN_Msk); /* 使能GPIO外设时钟 */
                CLR_REG32_BIT(GPIOA->ADS, GPIO_ADS_PIN07_Msk);                        /* 配置为数字端口 */
                CLR_REG32_BIT(GPIOA->PIN07_SEL, GPIO_PIN07_SEL_SEL_Msk);              /* 设置为GPIO */
                SET_REG32_BIT(GPIOA->DIR, GPIO_DIR_PIN07_Msk);                        /* 配置为输入 */
                SYSCTRL_SysctrlUnlock();
                SET_REG32_BIT(SYSCTRL->SYSCTRL1, SYSCTRL_SYSCTRL1_EXTL_EN_Msk);                                 /* 使能EXTL时钟输入 */
                while (READ_REG32_BIT(SYSCTRL->XTL_CR, SYSCTRL_XTL_CR_STABLE_Msk) != SYSCTRL_XTL_CR_STABLE_Msk) /* 等待EXTL时钟稳定 */
                {
                    ;
                }
                SYSCTRL_SysctrlUnlock();
                CLR_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_XTL_EN_Msk); /* 禁止XTL */
            }
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }
    return enRet;
}

/**
 * @brief  系统时钟源禁止
 * @param  [in] u32ClockSrc 目标时钟源 @ref SYSCTRL_Clock_Src_Select
 * @retval en_result_t
 *           - Ok: 设定成功
 *           - ErrorInvalidParameter：无效参数
 * @note   系统时钟源禁止前，必须确认被关闭的时钟源没有被使用
 */
en_result_t SYSCTRL_ClockSrcDisable(uint32_t u32ClockSrc)
{
    en_result_t enRet = Ok;

    if (u32ClockSrc > SYSCTRL_CLK_SRC_EXTL)
    {
        return ErrorInvalidParameter;
    }

    switch (u32ClockSrc)
    {
        case SYSCTRL_CLK_SRC_RC48M_4M:
        case SYSCTRL_CLK_SRC_RC48M_6M:
        case SYSCTRL_CLK_SRC_RC48M_32M:
        case SYSCTRL_CLK_SRC_RC48M_48M:
            SYSCTRL_SysctrlUnlock();
            CLR_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_RC48M_EN_Msk); /* 禁止RC48M */
            break;
        case SYSCTRL_CLK_SRC_EXTH:
            SYSCTRL_SysctrlUnlock();
            CLR_REG32_BIT(SYSCTRL->SYSCTRL1, SYSCTRL_SYSCTRL1_EXTH_EN_Msk); /* 禁止EXTH时钟输入 */
            break;
        case SYSCTRL_CLK_SRC_RCL_32768:
        case SYSCTRL_CLK_SRC_RCL_38400:
            SYSCTRL_SysctrlUnlock();
            CLR_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_RCL_EN_Msk); /* 禁止RCL */
            break;
        case SYSCTRL_CLK_SRC_XTL:
            SYSCTRL_SysctrlUnlock();
            CLR_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_XTL_EN_Msk); /* 禁止XTL */
            break;
        case SYSCTRL_CLK_SRC_EXTL:
            SYSCTRL_SysctrlUnlock();
            CLR_REG32_BIT(SYSCTRL->SYSCTRL1, SYSCTRL_SYSCTRL1_EXTL_EN_Msk); /* 禁止EXTL时钟输入 */
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }
    return enRet;
}

/**
 * @brief  系统时钟切换
 * @param  [in] u32ClockSrc 时钟源 @ref SYSCTRL_Clock_Src_Select
 * @retval en_result_t
 *           - Ok: 设定成功
 *           - ErrorInvalidParameter：无效参数
 * @note   调用此函数前，必须确保新的系统时钟源的相关参数已经初始化，并且新时钟源已经使能且稳定运行
 * @note   本驱动默认宏定义：SYSTEM_EXTH=8MHz,SYSTEM_EXTL=32768Hz,如使用其它外部晶振值，必须修改这两个宏定义的值
 * @note   如手动修改或者调用CTRIM修改RC48M/RCL时钟的TRIM值，必须根据实际频率值设置正确的FLASH wait cycle
 * @note   如单独调用该函数，必须根据实际频率值设置正确的FLASH wait cycle
 */
en_result_t SYSCTRL_SysClockSwitch(uint32_t u32ClockSrc)
{
    if (u32ClockSrc > SYSCTRL_CLK_SRC_EXTL)
    {
        return ErrorInvalidParameter;
    }

