ZeroZap/xhsc/HC32L021/driver/src/hc32l021_sysctrl.c
    /* 加载Trim值 */
    switch (u32ClockSrc)
    {
        case SYSCTRL_CLK_SRC_RC48M_4M:
            /* 加载4M Trim值 */
            SYSCTRL->RC48M_CR = RC48M_CR_TRIM_4M_VAL;
            break;
        case SYSCTRL_CLK_SRC_RC48M_6M:
            /* 加载6M Trim值 */
            SYSCTRL->RC48M_CR = RC48M_CR_TRIM_6M_VAL;
            break;
        case SYSCTRL_CLK_SRC_RC48M_32M:
            /* 加载32M Trim值 */
            SYSCTRL->RC48M_CR = RC48M_CR_TRIM_32M_VAL;
            break;
        case SYSCTRL_CLK_SRC_RC48M_48M:
            /* 加载48M Trim值 */
            SYSCTRL->RC48M_CR = RC48M_CR_TRIM_48M_VAL;
            break;
        case SYSCTRL_CLK_SRC_EXTH:
            break;
        case SYSCTRL_CLK_SRC_RCL_32768:
            /* 加载32768 Trim值 */
            SYSCTRL->RCL_CR = RCL_CR_TRIM_32768_VAL;
            break;
        case SYSCTRL_CLK_SRC_RCL_38400:
            /* 加载38400 Trim值 */
            SYSCTRL->RCL_CR = RCL_CR_TRIM_38400_VAL;
            break;
        case SYSCTRL_CLK_SRC_XTL:
            break;
        case SYSCTRL_CLK_SRC_EXTL:
            break;
        default:
            break;
    }

    /* 切换时钟源 */
    switch (u32ClockSrc)
    {
        case SYSCTRL_CLK_SRC_RC48M_4M:
        case SYSCTRL_CLK_SRC_RC48M_6M:
        case SYSCTRL_CLK_SRC_RC48M_32M:
        case SYSCTRL_CLK_SRC_RC48M_48M:
            SYSCTRL_SysctrlUnlock();
            MODIFY_REG32(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_CLKSW_Msk, SYSCTRL_CLK_SWITCH_RC48M);
            break;
        case SYSCTRL_CLK_SRC_EXTH:
            SYSCTRL_SysctrlUnlock();
            MODIFY_REG32(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_CLKSW_Msk, SYSCTRL_CLK_SWITCH_EXTH);
            break;
        case SYSCTRL_CLK_SRC_RCL_32768:
        case SYSCTRL_CLK_SRC_RCL_38400:
            SYSCTRL_SysctrlUnlock();
            MODIFY_REG32(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_CLKSW_Msk, SYSCTRL_CLK_SWITCH_RCL);
            break;
        case SYSCTRL_CLK_SRC_XTL:
        case SYSCTRL_CLK_SRC_EXTL:
            SYSCTRL_SysctrlUnlock();
            MODIFY_REG32(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_CLKSW_Msk, SYSCTRL_CLK_SWITCH_XTL);
            break;
        default:
            break;
    }

    return Ok;
}

/**
 * @brief  系统时钟（HCLK）分频设定
 * @param  [in] u32HclkDiv 分频设定值 @ref SYSCTRL_Hclk_Div_Select
 * @retval None
 * @note   如单独调用该函数，必须根据实际频率值设置正确的FLASH wait cycle
 */
void SYSCTRL_HclkDivSet(uint32_t u32HclkDiv)
{
    SYSCTRL_SysctrlUnlock();
    MODIFY_REG32(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_HCLK_PRS_Msk, u32HclkDiv);
}

/**
 * @brief  系统时钟（HCLK）频率值获取
 * @retval uint32_t HCLK频率值
 * @note   本驱动默认宏定义：SYSTEM_EXTH=8MHz,SYSTEM_EXTL=32768Hz,如使用其它频率外部时钟或晶振，必须修改这两个宏定义的值
 * @note   如果手动修改或者调用CTRIM修改RC48M/RCL时钟的TRIM值，必须修改为实际时钟频率值
 */

uint32_t SYSCTRL_HclkFreqGet(void)
{
    uint32_t u32Fre         = 0u;
    uint32_t u32Temp        = 0u;
    uint32_t u32ClockSwitch = READ_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_CLKSW_Msk);

    switch (u32ClockSwitch)
    {
        case SYSCTRL_CLK_SWITCH_RC48M:
            u32Temp = READ_REG32_BIT(SYSCTRL->RC48M_CR, SYSCTRL_RC48M_CR_FSEL_Msk);
            switch (u32Temp)
            {
                case SYSCTRL_RC48M_FREQ_4M:
                    u32Fre = 4000000u;
                    break;
                case SYSCTRL_RC48M_FREQ_6M:
                    u32Fre = 6000000u;
                    break;
                case SYSCTRL_RC48M_FREQ_32M:
                    u32Fre = 32000000u;
                    break;
                case SYSCTRL_RC48M_FREQ_48M:
                    u32Fre = 48000000u;
                    break;
                default:
                    break;
            }
            break;
        case SYSCTRL_CLK_SWITCH_EXTH:
            u32Fre = SYSTEM_EXTH;
            break;
        case SYSCTRL_CLK_SWITCH_RCL:
            u32Temp = SYSCTRL->RCL_CR;
            if (u32Temp == RCL_CR_TRIM_32768_VAL)
            {
                u32Fre = 32768u;
            }
            else if (u32Temp == RCL_CR_TRIM_38400_VAL)
            {
                u32Fre = 38400u;
            }
            else
            {
                ;
            }
            break;
        case SYSCTRL_CLK_SWITCH_XTL:
            u32Fre = SYSTEM_EXTL;
            break;
        default:
            break;
    }

    return (u32Fre >> SYSCTRL->SYSCTRL0_f.HCLK_PRS);
}

/**
 * @brief  内部高速时钟RC48M频率TRIM值加载
 * @param  [in] u32Rc48mFre 设定的RC48M目标频率值 @ref SYSCTRL_RC48M_Freq_Select
 * @retval None
 */
void SYSCTRL_RC48MTrimSet(uint32_t u32Rc48mFre)
{
    /* 加载Trim值 */
    switch (u32Rc48mFre)
    {
        case SYSCTRL_RC48M_FREQ_4M:
            /* 加载4M Trim值 */
            SYSCTRL->RC48M_CR = RC48M_CR_TRIM_4M_VAL;
            break;
        case SYSCTRL_RC48M_FREQ_6M:
            /* 加载6M Trim值 */
            SYSCTRL->RC48M_CR = RC48M_CR_TRIM_6M_VAL;
            break;
        case SYSCTRL_RC48M_FREQ_32M:
            /* 加载32M Trim值 */
            SYSCTRL->RC48M_CR = RC48M_CR_TRIM_32M_VAL;
            break;
        case SYSCTRL_RC48M_FREQ_48M:
            /* 加载48M Trim值 */
            SYSCTRL->RC48M_CR = RC48M_CR_TRIM_48M_VAL;
            break;
        default:
            break;
    }
}

/**
 * @brief  内部低速时钟RCL频率TRIM值加载
 * @param  [in] u32RclFre 设定的RCL目标频率值 @ref SYSCTRL_RCL_Freq_Select
 * @retval None
 */
void SYSCTRL_RCLTrimSet(uint32_t u32RclFre)
{
    if (u32RclFre == SYSCTRL_RCL_FREQ_32768)
    {
        /* 加载32768 Trim值 */
        SYSCTRL->RCL_CR = RCL_CR_TRIM_32768_VAL;
    }
    else
    {
        /* 加载38400 Trim值 */
        SYSCTRL->RCL_CR = RCL_CR_TRIM_38400_VAL;
    }
}

/**
 * @brief  外部低速时钟稳定周期配置
 * @param  [in] u32XtlStableTime 外部低速时钟稳定周期设置 @ref SYSCTRL_XTL_Stable_Cycle_Select
 * @retval None
 */
void SYSCTRL_XTLStableTimeSet(uint32_t u32XtlStableTime)
{
    MODIFY_REG32(SYSCTRL->XTL_CR, SYSCTRL_XTL_CR_STARTUP_Msk, u32XtlStableTime);
}

/**
 * @brief  外部低速晶振驱动配置
 * @param  [in] u32XtlAmp 外部低速晶振幅选择 @ref SYSCTRL_XTL_Amp_Select
 * @param  [in] u32XtlDrv 外部低速晶振驱动能力选择 @ref SYSCTRL_XTL_Drv_Select
 * @retval None
 */
void SYSCTRL_XTLDrvConfig(uint32_t u32XtlAmp, uint32_t u32XtlDrv)
{
    MODIFY_REG32(SYSCTRL->XTL_CR, SYSCTRL_XTL_CR_AMP_SEL_Msk | SYSCTRL_XTL_CR_DRIVER_Msk, u32XtlAmp | u32XtlDrv);
}

/**
 * @brief  外部低速晶振停振检测配置
 * @param  [in] u32XtlFailure XTL停振检测配置 @ref SYSCTRL_XTL_Failure_Config
 * @retval None
 * @note   当XTL_EN=1时，不要修改DETTIME位
 */
void SYSCTRL_XTLFailureConfig(uint32_t u32XtlFailure)
{
    if (READ_REG32_BIT(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_XTL_EN_Msk) == 0u)
    {
        MODIFY_REG32(SYSCTRL->XTL_CR, SYSCTRL_XTL_CR_DETTIME_Msk, u32XtlFailure);
    }
    MODIFY_REG32(SYSCTRL->XTL_CR, SYSCTRL_XTL_CR_DETEN_Msk, u32XtlFailure);
}

/**
 * @brief  使能XTL失效检测中断
 * @retval None
 */
void SYSCTRL_XTLFailureIntEnable(void)
{
    SET_REG32_BIT(SYSCTRL->XTL_CR, SYSCTRL_XTL_CR_DETIE_Msk);
}

/**
 * @brief  禁止XTL失效检测中断
 * @retval None
 */
void SYSCTRL_XTLFailureIntDisable(void)
{
    CLR_REG32_BIT(SYSCTRL->XTL_CR, SYSCTRL_XTL_CR_DETIE_Msk);
}

/**
 * @brief  获取XTL失效检测中断标志
 * @retval boolean_t
 *           - TRUE: 中断标志置位
 *           - FALSE: 中断标志未置位
 */
boolean_t SYSCTRL_XTLFailureIntFlagGet(void)
{
    return READ_REG32_BIT(SYSCTRL->XTL_CR, SYSCTRL_XTL_CR_FAULT_STATE_Msk) ? TRUE : FALSE;
}

/**
 * @brief  清除XTL失效检测中断标志
 * @retval None
 */
void SYSCTRL_XTLFailureIntFlagClear(void)
{
    CLR_REG32_BIT(SYSCTRL->XTL_CR, SYSCTRL_XTL_CR_FAULT_STATE_Msk);
}

/**
 * @brief  XTL always on使能
 * @retval None
 */
void SYSCTRL_XTLAlwaysOnEnable(void)
{
    SYSCTRL_SysctrlUnlock();
    SET_REG32_BIT(SYSCTRL->SYSCTRL1, SYSCTRL_SYSCTRL1_XTL_ALWAYS_ON_Msk);
}

/**
 * @brief  XTL always on禁止
 * @retval None
 */
void SYSCTRL_XTLAlwaysOnDisable(void)
{
    SYSCTRL_SysctrlUnlock();
    CLR_REG32_BIT(SYSCTRL->SYSCTRL1, SYSCTRL_SYSCTRL1_XTL_ALWAYS_ON_Msk);
}

/**
 * @brief  外设时钟使能
 * @param  [in] enPeriph 目标外设 @ref en_sysctrl_periph_clock_t
 * @retval None
 */
void SYSCTRL_PeriphClockEnable(en_sysctrl_periph_clock_t enPeriph)
{
    if (enPeriph & 0x20u)
    {
        enPeriph &= ~0x20u;
        SET_REG32_BIT(SYSCTRL->PERI_CLKEN1, 0x1u << enPeriph);
    }
    else
    {
        SET_REG32_BIT(SYSCTRL->PERI_CLKEN0, 0x1u << enPeriph);
    }
}

/**
 * @brief  外设时钟禁止
 * @param  [in] enPeriph 目标外设 @ref en_sysctrl_periph_clock_t
 * @retval None
 */
void SYSCTRL_PeriphClockDisable(en_sysctrl_periph_clock_t enPeriph)
{
    if (enPeriph & 0x20u)
    {
        enPeriph &= ~0x20u;
        CLR_REG32_BIT(SYSCTRL->PERI_CLKEN1, 0x1u << enPeriph);
    }
    else
    {
        CLR_REG32_BIT(SYSCTRL->PERI_CLKEN0, 0x1u << enPeriph);
    }
}

/**
 * @brief  获得外设时钟门控开关状态
 * @param  [in] enPeripheral 目标外设 @ref en_sysctrl_periph_clock_t
 * @retval boolean_t
 *           - TRUE: 开启
 *           - FALSE: 关闭
 */
boolean_t SYSCTRL_PeriphClockStatusGet(en_sysctrl_periph_clock_t enPeriph)
{
    if (enPeriph & 0x20u)
    {
        enPeriph &= ~0x20u;
        return READ_REG32_BIT(SYSCTRL->PERI_CLKEN1, 0x1u << enPeriph) ? TRUE : FALSE;
    }
    else
    {
        return READ_REG32_BIT(SYSCTRL->PERI_CLKEN0, 0x1u << enPeriph) ? TRUE : FALSE;
    }
}

/**
 * @brief 系统功能使能
 * @param [in] u32Func 系统功能类型 @ref SYSCTRL_Func_Config
 * @retval None
 */
void SYSCTRL_FuncEnable(uint32_t u32Func)
{
    SYSCTRL_SysctrlUnlock();
    SET_REG32_BIT(SYSCTRL->SYSCTRL1, u32Func);
}

/**
 * @brief 系统功能禁止
 * @param [in] u32Func 系统功能类型 @ref SYSCTRL_Func_Config
 * @retval None
 */
void SYSCTRL_FuncDisable(uint32_t u32Func)
{
    SYSCTRL_SysctrlUnlock();
    CLR_REG32_BIT(SYSCTRL->SYSCTRL1, u32Func);
}

/**
 * @brief  从Deep Sleep唤醒后system clock来源配置
 * @param  [in] u32WakeupSrc 从Deep Sleep唤醒后system clock来源 @ref SYSCTRL_Wakeup_By_RC48M_Config
 * @retval None
 */
void SYSCTRL_WakeupByRC48M(uint32_t u32WakeupSrc)
{
    SYSCTRL_SysctrlUnlock();
    MODIFY_REG32(SYSCTRL->SYSCTRL0, SYSCTRL_SYSCTRL0_WAKEUP_BYRC48M_Msk, u32WakeupSrc);
}

/**
 * @brief  时钟去初始化函数
 * @retval None
 */
void SYSCTRL_ClockDeInit(void)
{
    /* 时钟源使能 */
    SYSCTRL_ClockSrcEnable(SYSCTRL_CLK_SRC_RC48M_4M);

    /* 时钟源切换 */
    SYSCTRL_SysClockSwitch(SYSCTRL_CLK_SRC_RC48M_4M);

