ZeroZap/xhsc/HC32L021/driver/src/hc32l021_sysctrl.c
    /* 其它时钟源使能关闭 */
    SYSCTRL_ClockSrcDisable(SYSCTRL_CLK_SRC_EXTH);      /* 禁止EXTH端口输入时钟 */
    SYSCTRL_ClockSrcDisable(SYSCTRL_CLK_SRC_RCL_32768); /* 禁止RCL */
    SYSCTRL_ClockSrcDisable(SYSCTRL_CLK_SRC_XTL);       /* 禁止XTL */
    SYSCTRL_ClockSrcDisable(SYSCTRL_CLK_SRC_EXTL);      /* 禁止EXTL端口输入时钟*/

    /* 时钟分频设置 */
    SYSCTRL_HclkDivSet(SYSCTRL_HCLK_PRS_DIV1);

    /* 更新Core时钟（HCLK）*/
    SystemCoreClockUpdate();
}

/**
 * @brief  外设模块复位
 * @param  [in] enPeriph 复位外设选择 @ref en_sysctrl_periph_reset_t
 * @retval None
 */
void SYSCTRL_PeriphReset(en_sysctrl_periph_reset_t enPeriph)
{
    if (enPeriph & 0x20u)
    {
        enPeriph &= ~0x20u;
        CLR_REG32_BIT(SYSCTRL->PERI_RESET1, 0x1u << enPeriph);
        SET_REG32_BIT(SYSCTRL->PERI_RESET1, 0x1u << enPeriph);
    }
    else
    {
        CLR_REG32_BIT(SYSCTRL->PERI_RESET0, 0x1u << enPeriph);
        SET_REG32_BIT(SYSCTRL->PERI_RESET0, 0x1u << enPeriph);
    }
}

/**
 * @brief  获取复位源类型
 * @param  [in] u32ResetFlag 复位类型选择 @ref SYSCTRL_Reset_Flag_Select
 * @retval boolean_t
 *           - TRUE: 置位
 *           - FALSE: 未置位
 */
boolean_t SYSCTRL_ResetFlagGet(uint32_t u32ResetFlag)
{
    return READ_REG32_BIT(SYSCTRL->RESET_FLAG, u32ResetFlag) ? TRUE : FALSE;
}

/**
 * @brief  清除复位源类型
 * @param  [in] u32ResetFlag 复位类型选择 @ref SYSCTRL_Reset_Flag_Select
 * @retval None
 */
void SYSCTRL_ResetFlagClear(uint32_t u32ResetFlag)
{
    CLR_REG32_BIT(SYSCTRL->RESET_FLAG, u32ResetFlag);
}

/**
 * @brief  清除所有复位源类型
 * @retval None
 */
void SYSCTRL_ResetFlagClearAll(void)
{
    CLR_REG32(SYSCTRL->RESET_FLAG);
}

/**
 * @brief  调试模式下模块功能计数使能
 * @param  [in] u32DebugActiveConfig 调试模式下各模块 @ref SYSCTRL_Debug_Active_Config
 * @retval None
 */
void SYSCTRL_DebugActiveEnable(uint32_t u32DebugActiveConfig)
{
    CLR_REG32_BIT(SYSCTRL->DEBUG_ACTIVE, u32DebugActiveConfig);
}

/**
 * @brief  调试模式下模块功能计数暂停
 * @param  [in] u32DebugActiveConfig 调试模式下各模块 @ref SYSCTRL_Debug_Active_Config
 * @retval None
 */
void SYSCTRL_DebugActiveDisable(uint32_t u32DebugActiveConfig)
{
    SET_REG32_BIT(SYSCTRL->DEBUG_ACTIVE, u32DebugActiveConfig);
}

/**
 * @brief  结构体初始化
 * @param  [in] pstcInit 初始化结构体 @ref stc_sysctrl_clock_init_t
 * @retval None
 */
void SYSCTRL_ClockStcInit(stc_sysctrl_clock_init_t *pstcInit)
{
    pstcInit->u32SysClockSrc = SYSCTRL_CLK_SRC_RC48M_4M;
    pstcInit->u32HclkDiv     = SYSCTRL_HCLK_PRS_DIV1;
}
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
